{
    "art_data": [
        {
            "art_post_id": 0,
            "title": "Sonic Says Happy Chilli Dog Day",
            "date": "July 17, 2024",
            "subtext_sections":
                [
                    "Sonic says...happy early Chili Dog day! (It's really national hot dog day today, but I didn't want to wait another few days to draw this fella).",
                    "I chose to draw him in the Classic Sonic art style, since he just seems more memorable and fun to look at this way. I also used the galaxy brush on Procreate to make the background."
                ],
            "alt": "Sonic holding up a chilli dog while floating and relaxing in space",
            "tags": ["Procreate", "iPad", "Sonic", "Digital", "Fan Art"]
        },
        {
            "art_post_id": 1,
            "title": "Mr. E Mage and Audrey Meditate in the Woods",
            "date": "Feb 19, 2024",
            "subtext_sections":
                [
                    "When I drew this piece, I was in the midst of a prolonged art block. I used to easily imagine and draw my characters in different scenarios that ranged from comedic to angsty, but ever since I put my focus into school and work, I've noticed that creativity quickly pass me by.",
                    "I pressed my brain for ideas, and remembered the `Mentor Mentee` relationship between my characters, Mr. E Mage and Audrey. So here, I decided to highlight the differences in their demeanors and how they pass the time. The cool and calm Mr. E Mage shows Audrey how to let her thoughts pass her by, instead of latching onto every single one and allowing them to emotionally drain her."
                ],
            "alt": "A purple anthropomorphic rabbit meditates and sits next to a yellow anthropormorphic dinosaur girl in the middle of the forest. The girl has an uncomfortable look on her face as she meditates.",
            "tags": ["Procreate"]
        },
        {
            "art_post_id": 3,
            "title": "Espathra",
            "date": "June 2, 2024",
            "subtext_sections":
                [
                    "I've always been fascinated by Pokemon, ever since I was a child. I dabbled in collecting Pokemon cards, but had no idea how to play the trading card game. I went most of my life deeming it as a game that was likely `too difficult` to get into.",
                    "One day, however, my boyfriend pointed out a couple of EX Battle Decks at GameStop, and suggested we give the game a go. I got the Tinkaton deck, and was hooked to say the least. The game was much easier to get into than I thought, and so much fun to play.",
                    "Espathra is one of those unexpected Ace's in my deck that made me quite the competitor (especially the special one I picked up at the card shop). Upon closer inspection, I realized she had a striking design that I just had to draw, so here she is!"
                ],
            "alt": "An ostritch pokemon known as Espathra, with her leg lifted",
            "tags": ["Procreate"]
        },

        {
            "art_post_id": 4,
            "title": "Strawberry Shortcake",
            "date": "July 12, 2024",
            "subtext_sections":
                [
                    "Much like the rest of the youth online, I've been on a bit of a nostalgia kick lately! There's something about seeing merchandise from franchises I was in love with as a kid in stores today that makes me feel bubbly and safe in my heart.",
                    "I debated on the brush style to use for this one. For a girl like Strawberry Shortcake, it only seems logical to use a softer technical brush for the outline. But I went on a whim and drew her with a pixel brush instead, to give her a bit of extra character.",
                    "I feel that her warm colors and sharp lines create a nice contrast, contributing to her modern look in this piece."
                ],
            "alt": "A ragdoll girl named Strawberry Shortcake, holding a spoon and standing next to her plush pink cat.",
            "tags": ["Procreate"]
        },
        {
            "art_post_id": 5,
            "title": "Ramattra",
            "date": "Nov 17, 2023",
            "subtext_sections":
                [
                    "This Fall, I started playing Overwatch 2 with my friends online. The first character I learned to play is Ramattra- a tanky robot with a sleek design, and a violent thirst for vengence. His punches are deeply satisfying to dish towards the enemy team, and his play style forces you to take charge and make bold moves to help your team advance.",
                    "As the one and only tank on your team, it's obvious when you're making great or disappointing plays. It's nerve-wracking, but exhilerating all at once to play as this man.",
                    "This was a fun character study, as he not only has reflective robot parts, but also all kinds of fabrics and wrinkles that need careful attention in order to sell their realness. Practically every body part and piece of clothing was done on its own layer."
                ],
            "alt": "Ramattra, a robot with a mask, cable dreads, and robes.",
            "tags": ["Procreate"]
        },

        {
            "art_post_id": 6,
            "title": "A World of Hassle",
            "date": "Dec 31, 2023",
            "subtext_sections":
                [
                    "`Unbeknownst to her, she was about to enter a world of hassle`",
                    "Another year has gone by. It's time to bid 2023 farewell, and welcome 2024! This year's post is based on Alan Palomo's recent album, World of Hassle!",
                    "My partner and I went to one of his concerts this October and it was EVERYTHING we wanted to experience and more, so I wanted to commemorate this year with this album tribute. With every year, it’s scary feeling how much older I’m getting, but I’m starting to embrace it.",
                    "With college being over, I can finally cultivate my life freely, and discover who I am all over again. Thanks for sticking around, and feel free to give Palomo’s album a listen! It’s one heck of a vibe 💫 Until next year 👀"
                ],
            "alt": "A woman wears a brick design shirt, with a brown jacket, brown pants, against a yellow backdrop. Based off Alan Palomo's World of Hassle Album.",
            "tags": ["Procreate"]
        }          
    ]

}