{
    "all_blog_data":
    [
        {
            "title": "Transformers One is More Than Meets the Eye",
            "date": "October 6, 2024",
            "content": 
                [
                    {
                        "subText": "I’ve grown tired of seeing creativity and inspiration dwindle with each film released these days. With countless sequels and franchise-based films hitting the big screen, it’s quickly become easy to tell when a film is a true creative project, or just another “cash grab”."
                    },
                    {
                        "subText": "But after giving it a chance, I learned this is not the case for “Transformers One”- an underestimated sci fi action film doused in drama and heart that truly quenches the thirst for creative movies with real stories to tell."
                    },
                    {
                        "subText": "This film was finely put together by a reputable cast of creative minds that have worked on films like “The Incredibles”, “Ratatouille”, “Avengers Infinity War”, and “No Exit”. Josh Cooley directed the film, while Eric Pearson wrote the screenplay alongside story writers Andrew Barrer and Gabriel Ferrari."
                    },
                    {
                        "subImage":0,
                        "subImageAlignment":2,
                        "imgWidthAndHeight": [1000, 1000],
                        "subText": "Courtsey of Paramount Pictures"

                    },
                    {
                        "subText": "When I first saw the trailer for “One”, I didn’t have high expectations of it due to the recent trends in filmmaking. In fact, I chose to skip on “Transformers Rise of the Beast” when it came out last year, but I still watched this most recent film to show my support for the animation medium."

                    },

                    {
                        "subText": "When the movie started, I was enthralled by the humanity shown by the bots living in Cybertron. Immediately, you can tell what each robots’ place in society was, and what each of their greatest problems were."
                    },
                    {
                        "subText": "I was extremely surprised to be engaged through the whole movie."
                    },

                    {
                        "subText": "Surprised to WANT to see the relationship between these characters progress. "
                    },

                    {
                        "subText": "I was amazed at how good the writers and animators were at slowly, sublimely developing the characters. Each scene in the film meant something, was trying to say something the costs of “doing what’s right, even though it’s hard”. We witness self and social evolution as the characters grapple with who they are now, who they could become, and whether they’re capable of change."
                    },
                    
                    {
                        "subText": "Though “One” is “the cheapest of the Paramount Transformers Movies”, according to ScreenRant, it’s also the most valuable in terms of creativity and entertainment. Sadly, the film isn’t doing too well, with a budget of $75 million and a $97 million box office revenue."
                    },                 
                    {
                        "subText": "Even if you know nothing about the franchise, if you want to see more fantastical, inspiring movies with real stories to tell, I urge you to go watch it at the theaters this year."
                    },
                    {
                        "subHeader":"What’s the Scoop on Cybertron? (Mild Spoilers)",
                        "subImage":1,
                        "subImageAlignment":2,
                        "imgWidthAndHeight": [1000, 1000],
                        "subText": "Courtsey of Paramount Pictures"
                    },
                    {
                        "subText": "“One” ingeniously shows us the kind of world these bots live in- a world that’s technologically way more advanced, but not very socially different from our own. The harmony created by the film’s visuals and writing prove to us that the characters have real relationships, personal and global stakes at play."
                    },
                    {
                        "subText": "In the film, we follow the story of how Orion Pax, an uncertain, rebellious young bot stumbles his way through becoming the grand, stoic leader of the Autobots. Most importantly, we learn how he and his best friend D-15 go their separate ways and consider each other enemies as Optimus Prime and Megatron."
                    },
                    {
                        "subText": "My favorite part of the movie is watching the characters grow into themselves. They grow from becoming innocent, passionate robots, into ones with higher confidence, and powerful resolve."
                    },
                    {
                        "subText": "We’re given a personal tour of the bots’ history together- they’re friends bonded by their shared destinies as miners, but they have different perspectives on how to lead their lives. Without getting into spoilers, Pax brings D-15 troublesome opportunities for greatness (whether his friend wills it or not), while D-15 does his best to ground Pax and keep themselves out of trouble."
                    },
                    {
                        "subImage":4,
                        "subImageAlignment":2,
                        "imgWidthAndHeight": [1000, 1000],
                        "subText": "Courtsey of Paramount Pictures"
                    },
                    {
                        "subText": "The film implies through various scenes and negative character interactions that the residents of Cybertron are split into factions, even before the “Autobot” vs “Deception” battle came to be.  We observe characters who aim to “do things by the book” to climb the corporal ladder, victim to discrimination from others with higher ranks in their society. We see how the highest ranking bot, Sentinel Prime, garners the admiration of Pax and D-15, who can only dream of becoming as influential as him someday."
                    },
                    {
                        "subText": "On Cybertron, due to some bots having transforming abilities and some going without it, classism becomes the “norm”, with many robots having make peace with the very fact despite yearning for more. Many lack confidence in theirselves, and the hope that change is possible. While Pax, a non-transforming robot, has done so by the start of the film, he always hopes and chooses to become “more than meets the eye”, which makes him a compelling protagonist in the film."
                    },
                    {
                        "subHeader":"Why this Prequel Film is a Boost to the Series and the Modern Film Landscape",
                        "subText": "Typically I’m not one to favor the “obvious” protagonists in media. Their characters seem static and flat to me- they generally show stoicism and “absolute moral clarity” that makes them hard to relate to."
                    },
                    {
                        "subText": "Although comics, the Michael Bay trilogy, and television programs tell the origin story of the Transformers in varying ways, this movie is a bite-sized, impactful way of doing so, especially for those who just want to see the destinies of these grandiose figures unfold in a gorgeous visual format."
                    },
                    {
                        "subImage":3,
                        "subImageAlignment":2,
                        "imgWidthAndHeight": [1000, 1000],
                        "subText": "Courtsey of Paramount Pictures"
                    },
                    {
                        "subText": "The film highlights D-15’s humanity from the start by showcasing his humorous side and his soft-hearted nature when it comes to his personal interests- qualities that aren’t revealed to us in traditional “Transformers” media. The creators of the film make it a treat to watch this noble, determined individual’s slow decent into Megatron, and Orion’s ascent into Optimus when their world is turned upside down."
                    },
                    {
                        "subText": "We also see how people handle being perceived as “lesser members” of society, being “told what they are”, and how some do their best to stand out as “one of the good ones”, not questioning the seemingly ordinary tasks they are to execute."
                    },
                    {
                        "subText": "By the end of the film, I felt more connected with characters like Optimus Prime and Megatron, characters that I once felt emotionally disconnected from . Their plights and journeys are ones I, and many others can easily follow and fall in love with."
                    },
                    {
                        "subImage":2,
                        "subImageAlignment":2,
                        "imgWidthAndHeight": [1000, 1000],
                        "subText": "Courtsey of Paramount Pictures"
                    },
                    {
                        "subText":"Aside from the captivating story, the film is absolute eye candy!"
                    },
                    {
                        "subText":"It’s no wonder that Industrial Light & Magic, a George Lucas founded SFX company, was contracted to create these stunning animations. The producers’ money was well spent leveraging their services, as the film’s colorful, vibrant, futuristic scenes make Transformers One stand out above the rest of the Transformers films created in the past. In fast-paced fight scenes, I was captivated by the glowing eyes of the bots creating rays that dance and disappear seamlessly across the screen."
                    },
                    {
                        "subHeader":"Seriously, what could Possibly be Better About this Movie?",
                        "subText": "Regarding weaknesses, the film hardly has any (but I will update if this changes when I watch the movie a second time)."
                    },
                    {
                        "subText": "The only thing might be that the movie could showcase the plight of women a little more. “Transformers One” heavily focuses on the relationship of Pax and D-15, but Elita-1 could have benefitted from a bit more character development. The film does demonstrate her progress from being a strict robot who disregards those she doesn’t understand, to being one who bends the rules and respects others’ differences. But what do we learn about her, other than her dedication to her work and her generic fight for good? Not much.",
                        "subImage":5,
                        "subImageAlignment":1,
                        "imgWidthAndHeight": [500, 500]
                    },
                    {
                        "subText": "I’d like to see more scenes that reveal who she really is to us, even in minor ways, like we see so frequently with characters like D-15. "
                    },
                    {
                        "subText": "Another note is that Bumblebee is the “comedic relief” of the movie, per usual. However, he talks a whole lot, and makes many verbal jokes that just don’t land. The funniest joke was one where he didn’t even talk at all (go watch it, and you’ll immediately know what I mean ;)) I’m not usually a fan of “comedic relief” characters, but this movie employs it consistently."
                    },
                    {
                        "subText": "On a “miner” note, there are also fans who are disappointed that Pax is a miner and not an archivist, per the original lore. However, I don’t think this is a significant problem, as the film makes notable nods towards the “bookish nature” that lives within the character. Having both Pax and D-15 in the same line of work is an easy way to initialize their friendship, while showing us the most interesting parts of their relationship in a 2hr time constraint. "
                    },
                    {
                        "subHeader": "Autobots, ROLL OUT to the Theaters (at ONCE)!",
                        "subText": "As aforementioned, the only way this movie TRULY suffers, is through its relatively low performance at the box office- thanks to its lackluster marketing. "
                    },
                    {
                        "subText": "Various sources claim they hardly saw anything about the movie in advertising, and even hardcore fans of the “Transformers” franchise never heard of the film being in the making or existing, until well after its release in theaters. Fans even go as far as to claim the performance of the movie at the box office is entirely due to trailers that completely undermine the weight of the story and its creative merit."
                    },
                    {
                        "subText": "Overall, “Transformers One” is the type of film that audiences of all ages can enjoy, and it needs all of our support at the box office. "
                    },
                    {
                        "subText": "We have the power to vote with our money- if we want to continue to see this type of movie, with genuine story power and creativity, we must prove it by supporting it in theaters."
                    },      
                    {
                        "subImage":6,
                        "subImageAlignment":2,
                        "imgWidthAndHeight": [1000, 1000],
                        "subText": "Courtsey of Paramount Pictures"
                    },              
                    {
                        "subText": "Just look at “Into the Spiderverse”. It did so well in the box office, and by word of mouth, that the movie’s positive effects on filmmaking literally leaked into other films, from other studios entirely. The movie had clear, unmistakeable influences on critically acclaimed films like “Meet the Mitchells”, “Puss in Boots 2”. "
                    },                    
                    {
                        "subText": "By supporting “Transformers One”, we stake our claim that we want to see more films with true heart and soul put into them- ESPECIALLY in the age of AI, where many creative minds are losing the chance to shine in films like this one."
                    },
                    {
                        "subHeader": "Sources",
                        "subText": "Sherlock, Ben. “Transformers One Budget & Box Office Explained: How Much It Needs to Make.” ScreenRant, 18 Sept. 2024, screenrant.com/transformers-one-budget-box-office-profit-comparison/."
                    },
                    {
                        "subText":"Jr, Mike Fleming. “Animated ‘transformers’ Prequel Activated; ’Toy Story 4’s Josh Cooley to Direct for Hasbro/eOne & Paramount.” Deadline, Deadline, 30 Apr. 2020, deadline.com/2020/04/transformers-animated-movie-paramount-hasbro-toy-story-4-director-josh-cooley-1202921100/."
                    },
                    {
                        "subText":"R/Boxoffice on Reddit: Paramount’s Transformers One Debuted with $24.61m Domestically This Weekend (from 3,978 Locations)., www.reddit.com/r/boxoffice/comments/1fnt5x2/paramounts_transformers_one_debuted_with_2461m/. Accessed 6 Oct. 2024."
                    },
                    {
                        "subText":"Paramount Pictures: Transformers One | Final Trailer (2024) - Chris Hemsworth, Brian Tyree Henry, Scarlett Johansson, https://www.youtube.com/watch?v=jaVcDaozGgc. Accessed 6 Oct. 2024"
                    }
                ]
        },
        {
            "title": "5 Minutes of Cleaning the Instant Pot",
            "date": "August 19, 2024",
            "content": 
                [
                    {
                        "subText": "“At least this’ll help us prevent the moss meat,”"
                    },
                    {
                        "subText": "I hear my boyfriend say, as I stare down at the beef broth sitting in the instant pot. Just before this, I opened a random page from my “5 Minutes of Bliss” book, hoping to find some cute activity to pass the time with, and to have a nice story to blog about."
                    },
                    {
                        "subImage": 0,
                        "subText": "But nope, in a sick twist of fate, I turn onto the “Cross One Thing Off Your To Do List” page. I set a 5 minute timer and went to work: pouring the collagen gunk into a bag, throwing it in the trash, and scraping off the sides and bottoms a few times. It’s an annoying task, certainly not one I wanted to do after a day of work and working out. But before I knew it, the worst was over, and I ended up with a pot soaking in hot, soapy water. Finally free of its beefy curse."
                    },
                    {
                        "subText": "And who knows how long I’ll let that pot sit there before I finish the job. But what matters is that I saved my future self from dealing with mossy meat."
                    },

                    {
                        "subText": "Though I hoped to walk away from the book with some romantic experience to reflect on (like coloring a picture, meditating, or planning a picnic), I walked away with something I truly needed- time to handle some little thing weighing on my shoulders. The real necessities in life may be repetitive, and they aren’t always going to be glamorous. But tending to them only helps you enjoy life more, so you can be more free and in tune with the present moment."
                    },
                    {
                        "subText": "Making moments like these fun by turning tasks into challenges, doing something in the presence of a loved one, or simply acknowledging the tiny, slow, repetitive movements that make us human, can grease the wheels of life. Instead of falling into the trap of Sisyphus, feeling dread as we push through the same challenges everyday, we can fall in love with the feeling of being alive. Over, and over again."
                    },

                    {
                        "subText": "Re-learning what it means to live, as many times as we need to."
                    },

                    {
                        "subText": "So, I may have to clean a greasy instant pot every week. But it really isn’t bad to spend 5 minutes cleaning and disposing of its garbage. Ending up with a pot to clean means I spent the time to cook good, real food, which is something definitely worth celebrating. "
                    }
                ]
        }
    ]
}
